Host/messages.xml

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2009-05-11T14:40:26.0248479Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="Host" ProcessID="4076" ThreadID="4" /><Channel/><Computer>SNARAYANL</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2009-05-11T20:10:26.0248479+05:30" Source="ServiceLevelReceiveRequest" Type="System.ServiceModel.Channels.MessagePatterns+PatternMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><a:Action s:mustUnderstand="1">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGig</a:Action><a:MessageID>urn:uuid:3e46aead-5b18-4825-b062-b4a891e9da62</a:MessageID><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">net.tcp://localhost:9000/GigManagerService</a:To></s:Header><s:Body><SaveGig xmlns="http://www.thatindigogirl.com/samples/2006/06"><item xmlns:b="http://schemas.datacontract.org/2004/07/ContentTypes" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><b:DateEnd>0001-01-01T00:00:00</b:DateEnd><b:DateStart>0001-01-01T00:00:00</b:DateStart><b:Description>Join the band for a rockin' party to celebrate our second CD release!</b:Description><b:Id>0</b:Id><b:Title>Join the band for a rockin' party to celebrate our second CD release!</b:Title><b:Url i:nil="true"></b:Url></item></SaveGig></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2009-05-11T14:40:26.0560977Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="Host" ProcessID="4076" ThreadID="4" /><Channel/><Computer>SNARAYANL</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2009-05-11T20:10:26.0560977+05:30" Source="ServiceLevelSendReply" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><a:Action s:mustUnderstand="1">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGigResponse</a:Action></s:Header><s:Body><SaveGigResponse xmlns="http://www.thatindigogirl.com/samples/2006/06"></SaveGigResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>