Host/App_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2009-05-11T13:29:00.8536692Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="Host" ProcessID="2536" ThreadID="4" /><Channel/><Computer>SNARAYANL</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2009-05-11T18:59:00.8536692+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.MessagePatterns+PatternMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><Action s:mustUnderstand="1" xmlns="http://www.w3.org/2005/08/addressing">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGig</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:46e0874d-b132-4fbb-8070-82ca1f227504</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo><To s:mustUnderstand="1" xmlns="http://www.w3.org/2005/08/addressing">net.tcp://localhost:9000/GigManagerService</To></s:Header></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2009-05-11T13:29:00.8849190Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="Host" ProcessID="2536" ThreadID="4" /><Channel/><Computer>SNARAYANL</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2009-05-11T18:59:00.8849190+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><a:Action s:mustUnderstand="1" xmlns:a="http://www.w3.org/2005/08/addressing">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGigResponse</a:Action><a:RelatesTo xmlns:a="http://www.w3.org/2005/08/addressing">urn:uuid:46e0874d-b132-4fbb-8070-82ca1f227504</a:RelatesTo><ActivityId CorrelationId="26e31140-4a6f-4a87-9eb5-96014fe149cb" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId><a:To s:mustUnderstand="1" xmlns:a="http://www.w3.org/2005/08/addressing">http://www.w3.org/2005/08/addressing/anonymous</a:To></s:Header></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2009-05-11T13:32:11.9618211Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="Host" ProcessID="2684" ThreadID="4" /><Channel/><Computer>SNARAYANL</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2009-05-11T19:02:11.9618211+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.MessagePatterns+PatternMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><Action s:mustUnderstand="1" xmlns="http://www.w3.org/2005/08/addressing">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGig</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:abdf80c7-ae0d-43c6-a55c-be8a737f63c6</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo><To s:mustUnderstand="1" xmlns="http://www.w3.org/2005/08/addressing">net.tcp://localhost:9000/GigManagerService</To></s:Header></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2009-05-11T13:32:11.9774460Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="Host" ProcessID="2684" ThreadID="4" /><Channel/><Computer>SNARAYANL</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2009-05-11T19:02:11.9774460+05:30" Source="ServiceLevelReceiveRequest" Type="System.ServiceModel.Channels.MessagePatterns+PatternMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><Action s:mustUnderstand="1" xmlns="http://www.w3.org/2005/08/addressing">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGig</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:abdf80c7-ae0d-43c6-a55c-be8a737f63c6</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo><To s:mustUnderstand="1" xmlns="http://www.w3.org/2005/08/addressing">net.tcp://localhost:9000/GigManagerService</To></s:Header></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2009-05-11T13:32:12.0086958Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="Host" ProcessID="2684" ThreadID="4" /><Channel/><Computer>SNARAYANL</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2009-05-11T19:02:12.0086958+05:30" Source="ServiceLevelSendReply" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><Action s:mustUnderstand="1" xmlns="http://www.w3.org/2005/08/addressing">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGigResponse</Action></s:Header></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2009-05-11T13:32:12.0086958Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="Host" ProcessID="2684" ThreadID="4" /><Channel/><Computer>SNARAYANL</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2009-05-11T19:02:12.0086958+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><a:Action s:mustUnderstand="1" xmlns:a="http://www.w3.org/2005/08/addressing">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGigResponse</a:Action><a:RelatesTo xmlns:a="http://www.w3.org/2005/08/addressing">urn:uuid:abdf80c7-ae0d-43c6-a55c-be8a737f63c6</a:RelatesTo><ActivityId CorrelationId="9ff161fe-02a5-4cee-9984-34bd9dac586d" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId><a:To s:mustUnderstand="1" xmlns:a="http://www.w3.org/2005/08/addressing">http://www.w3.org/2005/08/addressing/anonymous</a:To></s:Header></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2009-05-11T13:34:37.0233927Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="Host" ProcessID="4032" ThreadID="4" /><Channel/><Computer>SNARAYANL</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2009-05-11T19:04:37.0233927+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.MessagePatterns+PatternMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><a:Action s:mustUnderstand="1">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGig</a:Action><a:MessageID>urn:uuid:8e075d29-715b-4037-a0fa-322f4cee9922</a:MessageID><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">net.tcp://localhost:9000/GigManagerService</a:To></s:Header><s:Body><SaveGig xmlns="http://www.thatindigogirl.com/samples/2006/06"><item xmlns:b="http://schemas.datacontract.org/2004/07/ContentTypes" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><b:DateEnd>0001-01-01T00:00:00</b:DateEnd><b:DateStart>0001-01-01T00:00:00</b:DateStart><b:Description>Join the band for a rockin' party to celebrate our second CD release!</b:Description><b:Id>0</b:Id><b:Title>Join the band for a rockin' party to celebrate our second CD release!</b:Title><b:Url i:nil="true"></b:Url></item></SaveGig></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2009-05-11T13:34:37.0233927Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="Host" ProcessID="4032" ThreadID="4" /><Channel/><Computer>SNARAYANL</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2009-05-11T19:04:37.0233927+05:30" Source="ServiceLevelReceiveRequest" Type="System.ServiceModel.Channels.MessagePatterns+PatternMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><a:Action s:mustUnderstand="1">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGig</a:Action><a:MessageID>urn:uuid:8e075d29-715b-4037-a0fa-322f4cee9922</a:MessageID><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">net.tcp://localhost:9000/GigManagerService</a:To></s:Header><s:Body><SaveGig xmlns="http://www.thatindigogirl.com/samples/2006/06"><item xmlns:b="http://schemas.datacontract.org/2004/07/ContentTypes" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><b:DateEnd>0001-01-01T00:00:00</b:DateEnd><b:DateStart>0001-01-01T00:00:00</b:DateStart><b:Description>Join the band for a rockin' party to celebrate our second CD release!</b:Description><b:Id>0</b:Id><b:Title>Join the band for a rockin' party to celebrate our second CD release!</b:Title><b:Url i:nil="true"></b:Url></item></SaveGig></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2009-05-11T13:34:37.0546425Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="Host" ProcessID="4032" ThreadID="4" /><Channel/><Computer>SNARAYANL</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2009-05-11T19:04:37.0546425+05:30" Source="ServiceLevelSendReply" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><a:Action s:mustUnderstand="1">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGigResponse</a:Action></s:Header><s:Body><SaveGigResponse xmlns="http://www.thatindigogirl.com/samples/2006/06"></SaveGigResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2009-05-11T13:34:37.0546425Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="Host" ProcessID="4032" ThreadID="4" /><Channel/><Computer>SNARAYANL</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2009-05-11T19:04:37.0546425+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://www.thatindigogirl.com/samples/2006/06/GigManagerServiceContract/SaveGigResponse</a:Action><a:RelatesTo>urn:uuid:8e075d29-715b-4037-a0fa-322f4cee9922</a:RelatesTo><ActivityId CorrelationId="2c67fd53-b53f-401a-b8b4-d814da01ce8e" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId><a:To s:mustUnderstand="1">http://www.w3.org/2005/08/addressing/anonymous</a:To></s:Header><s:Body><SaveGigResponse xmlns="http://www.thatindigogirl.com/samples/2006/06"></SaveGigResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>